[
    {
        "title": "SEO Executive || Urgent Hiring || Sector 48 Gurugram - Gurgaon - Technians Softech - 0 to 1 yr",
        "description": "Implementing and developing SEO strategies. Research competitors on-site and off-site. Keyword research for content. Writing engaging SEO content and optimizing website regularly. Familiarity with Google Analytics and Search Console.",
        "keywords": [
            "Google Analytics",
            "SEO",
            "Keyword Research"
        ]
    },
    {
        "title": "Assistant Manager SEO (Healthcare Websites) - Noida - Max Healthcare - 5 to 8 yrs",
        "description": "Manage technical SEO and optimization for generative AI search. Improve organic leads and coordinate with contact centre & marketing. On-site visits to gather medical content inputs and liaise with doctors.",
        "keywords": [
            "Technical SEO",
            "AI Search",
            "Healthcare SEO"
        ]
    },
    {
        "title": "Senior SEO Specialist - Gurgaon - E-commerce - 3 to 6 yrs",
        "description": "Lead on-page & off-page SEO for large e-commerce portals. Product page optimization, category SEO, structured data, pagination, and site architecture improvements. Work with dev for Core Web Vitals.",
        "keywords": [
            "E-commerce SEO",
            "Schema",
            "Core Web Vitals"
        ]
    },
    {
        "title": "Technical SEO Analyst - Noida - SaaS - 2 to 5 yrs",
        "description": "Perform technical SEO audits, fix crawl issues, implement redirects, sitemaps, and canonical tags. Monitor logs, crawl budget and liaise with engineering for fixes.",
        "keywords": [
            "Technical SEO",
            "Log Analysis",
            "Sitemap"
        ]
    },
    {
        "title": "SEO Content Strategist - Delhi - Media - 1 to 4 yrs",
        "description": "Create topic clusters, editorial calendar, keyword intent mapping. Write and optimize long-form content, measure organic KPIs and coordinate with editorial & social teams.",
        "keywords": [
            "Content Strategy",
            "Keyword Research",
            "On-Page SEO"
        ]
    },
    {
        "title": "Off-Page SEO Executive - Noida - Agency - 1 to 3 yrs",
        "description": "Build high-quality backlinks, outreach for guest posts, manage citations and digital PR. Monitor backlink profile and disavow toxic links.",
        "keywords": [
            "Link Building",
            "Outreach",
            "Digital PR"
        ]
    },
    {
        "title": "Local SEO Specialist - Gurgaon - Real Estate - 2 to 5 yrs",
        "description": "Manage Google Business Profile, local citations, location pages, and localized content to improve map pack visibility and local leads.",
        "keywords": [
            "Local SEO",
            "Google Business Profile",
            "Citations"
        ]
    },
    {
        "title": "SEO Intern - Noida - Startup - 0 to 1 yr",
        "description": "Assist in keyword research, on-page optimization, meta tag creation, and basic analytics reporting. Learn SEO tools like Google Analytics and Moz.",
        "keywords": [
            "Intern",
            "Google Analytics",
            "On-Page SEO"
        ]
    },
    {
        "title": "SEO Manager (Performance Marketing) - Gurgaon - 4 to 7 yrs",
        "description": "Own organic growth, lead a small SEO team, coordinate with paid marketing for attribution, and report ROI of SEO to leadership.",
        "keywords": [
            "SEO Strategy",
            "Team Management",
            "Analytics"
        ]
    },
    {
        "title": "International SEO Executive - Noida - Export/Global - 2 to 4 yrs",
        "description": "Manage multilingual & multi-regional SEO, hreflang setup, international keyword research and coordinate regional content teams.",
        "keywords": [
            "International SEO",
            "hreflang",
            "Multilingual"
        ]
    },
    {
        "title": "YouTube SEO & Growth Manager - Gurgaon - Media - 3 to 6 yrs",
        "description": "Optimize video metadata, thumbnails, playlists, and channel structure. Improve organic video discovery and growth on YouTube.",
        "keywords": [
            "YouTube SEO",
            "Video Optimization",
            "Metadata"
        ]
    },
    {
        "title": "SEO Analyst (Analytics Specialist) - Noida - 2 to 4 yrs",
        "description": "Deep-dive into GA4 data, create dashboards, conversion funnels, and provide insights to improve organic conversions and CTR.",
        "keywords": [
            "GA4",
            "Analytics",
            "Dashboarding"
        ]
    },
    {
        "title": "Technical SEO & Site Reliability - Gurgaon - 4+ yrs",
        "description": "Work with SRE/Backend to fix page speed, lazy loading, caching strategy, and image optimization. Improve Core Web Vitals and site speed.",
        "keywords": [
            "Page Speed",
            "Core Web Vitals",
            "Caching"
        ]
    },
    {
        "title": "SEO Project Lead - Noida - Agency - 5+ yrs",
        "description": "Handle multiple client SEO accounts, provide strategy, reporting, client communication, and drive organic KPIs across verticals.",
        "keywords": [
            "Client Management",
            "Reporting",
            "Strategy"
        ]
    },
    {
        "title": "AI & Search Optimization Lead - Delhi NCR - 3 to 6 yrs",
        "description": "Optimize content & site for AI search and conversational engines (SGE, Perplexity). Implement structured data and content prompts for better AI answers.",
        "keywords": [
            "AI Search",
            "SGE",
            "Structured Data"
        ]
    },
    {
        "title": "SEO Copywriter (Hindi/English) - Noida - 1 to 3 yrs",
        "description": "Write SEO-friendly articles in Hindi and English, optimize meta descriptions, H1/H2, and internal links for target keywords.",
        "keywords": [
            "SEO Copywriting",
            "Hindi",
            "On-Page SEO"
        ]
    },
    {
        "title": "Ecommerce SEO - Marketplace Listing Specialist - Gurgaon - 1 to 3 yrs",
        "description": "Optimize product titles, bullet points, A+ content, image alt text and keyword mapping for marketplaces like Amazon & Flipkart.",
        "keywords": [
            "Marketplace SEO",
            "Product Optimization",
            "Amazon"
        ]
    },
    {
        "title": "Mobile SEO Specialist - Noida - 2 to 4 yrs",
        "description": "Improve mobile indexing, AMP pages, mobile site speed, and mobile UX to increase mobile organic traffic and conversions.",
        "keywords": [
            "Mobile SEO",
            "AMP",
            "Mobile Speed"
        ]
    },
    {
        "title": "SEO & Paid Synergy Lead - Gurgaon - 3 to 5 yrs",
        "description": "Coordinate SEO and PPC to improve top-of-funnel organic & paid efficiency, use paid data for keyword discovery and SEO experiments.",
        "keywords": [
            "PPC",
            "SEO",
            "A/B Testing"
        ]
    },
    {
        "title": "Content SEO Editor - Noida - Publishing - 2 to 4 yrs",
        "description": "Edit and optimize editorial content for search intent, apply topical authority, update evergreen pieces and run content audits.",
        "keywords": [
            "Content Audit",
            "Topical Authority",
            "Editing"
        ]
    },
    {
        "title": "SEO Automation Engineer - Gurgaon - 3 to 6 yrs",
        "description": "Build scripts & automation for rank tracking, content audits, large scale redirects and data pipelines for SEO reporting.",
        "keywords": [
            "Automation",
            "Python",
            "Rank Tracking"
        ]
    },
    {
        "title": "Local Listings & Reputation Manager - Noida - 1 to 3 yrs",
        "description": "Maintain local listings, reviews, respond to customers, and improve local search presence and conversions.",
        "keywords": [
            "Reputation",
            "Local Listings",
            "Reviews"
        ]
    },
    {
        "title": "SEO Trainer / Consultant - Gurgaon - Freelance/Contract",
        "description": "Provide SEO training to in-house teams or clients. Conduct audits, training workshops and implementation roadmaps.",
        "keywords": [
            "Training",
            "Consulting",
            "SEO Audit"
        ]
    },
    {
        "title": "Voice Search Optimization Specialist - Noida - 2 to 4 yrs",
        "description": "Optimize content for voice queries, implement FAQ schema, conversational content and monitor voice traffic.",
        "keywords": [
            "Voice Search",
            "FAQ Schema",
            "Conversational SEO"
        ]
    },
    {
        "title": "SEO Data Scientist - Gurgaon - 3 to 5 yrs",
        "description": "Use data modelling to predict keyword opportunity, measure content ROI, build forecasting models for organic growth.",
        "keywords": [
            "Data Science",
            "Forecasting",
            "SEO Analytics"
        ]
    },
    {
        "title": "Marketplace SEO Analyst - Noida - 2 to 4 yrs",
        "description": "Analyse marketplace search, competitor listings and improve discoverability within ecommerce platforms.",
        "keywords": [
            "Marketplace",
            "Listing Analysis",
            "SEO"
        ]
    },
    {
        "title": "International Content SEO Lead - Gurgaon - 4 to 7 yrs",
        "description": "Drive content SEO for APAC/EMEA markets, coordinate translators, and ensure international on-page best practices are followed.",
        "keywords": [
            "International",
            "Content Localization",
            "SEO"
        ]
    },
    {
        "title": "Freelance SEO Auditor - Remote - Contract",
        "description": "Perform one-time technical & content audit, provide prioritized fixes and ROI estimates for organic traffic recovery.",
        "keywords": [
            "Audit",
            "Technical SEO",
            "Freelance"
        ]
    },
    {
        "title": "SEO Growth Hacker - Noida - Startup - 1 to 3 yrs",
        "description": "Run rapid experiments, viral & content growth strategies, spike organic acquisition with low budget tactics.",
        "keywords": [
            "Growth Hacking",
            "Experiments",
            "SEO"
        ]
    }
]